<?php
/**
 * Created by PhpStorm.
 * User: laird
 * Date: 2019-04-11
 * Time: 00:12
 */

namespace app\api\service;


class HomeLand  extends  BaseService
{

    //1.比较两个地址是否在地级市



    //2.比较两个地址是否在县级市



    //3.比较两个地址是否在同个乡



    //4.比较2个地址是否在同个村


    //5 保存家庭地址


    //6 更新家乡地址



    //7 创建家庭地址


    //8 删除地址


    //9 是否婚嫁的地址



   //    //2.把老家的信息存入数据库中，save
    //
    //
    //
    //    //3 根据地级市编码获得信息
    //
    //
    //
    //    //4 根据县级市编码获得信息
    //
    //
    //
    //    //5 根据乡级编码获得信息
    //
    //
    //    //6 根据村编码获得信息



}